Repository: ZhengRui-Chen/glint
Catalog: mac-app/Glint/Localization/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hant

source: %@ shortcut could not be registered. Choose another combination from the menu bar.
zh_hans: %@ 快捷键无法注册。请从菜单栏里换一个组合键。
zh_hant: %@ 快捷鍵無法註冊。請從選單列裡換一個組合鍵。

source: %@ shortcut was reset to the default because the saved combination could not be registered.
zh_hans: 由于已保存的组合键无法注册，%@ 快捷键已重置为默认值。
zh_hant: 由於已儲存的組合鍵無法註冊，%@ 快捷鍵已重設為預設值。

source: Accessibility permission is not granted.
zh_hans: 尚未授予辅助功能权限。
zh_hant: 尚未授予輔助使用權限。

source: Accessibility permission is required for selection translation.
zh_hans: 进行划词翻译需要辅助功能权限。
zh_hant: 進行劃詞翻譯需要輔助使用權限。

source: Accessibility Permission: %@
zh_hans: 辅助功能权限：%@
zh_hant: 輔助使用權限：%@

source: API Key
zh_hans: API 密钥
zh_hant: API 金鑰

source: API Settings
zh_hans: API 设置
zh_hant: API 設定

source: API Settings…
zh_hans: API 设置…
zh_hant: API 設定…

source: API Status: Available
zh_hans: API 状态：可用
zh_hant: API 狀態：可用

source: API Status: Checking...
zh_hans: API 状态：检查中…
zh_hant: API 狀態：檢查中…

source: API Status: Error
zh_hans: API 状态：错误
zh_hant: API 狀態：錯誤

source: API Status: Unavailable
zh_hans: API 状态：不可用
zh_hant: API 狀態：不可用

source: Backend is currently unavailable
zh_hans: 后端当前不可用
zh_hant: 後端目前不可用

source: Backend is starting, please wait
zh_hans: 后端正在启动，请稍候
zh_hant: 後端正在啟動，請稍候

source: Base URL
zh_hans: 基础 URL
zh_hant: 基礎 URL

source: Browser automation permission is not granted.
zh_hans: 尚未授予浏览器自动化权限。
zh_hant: 尚未授予瀏覽器自動化權限。

source: Browser automation permission is not granted. Allow Glint to control the browser and try again.
zh_hans: 尚未授予浏览器自动化权限。请允许 Glint 控制浏览器后再试。
zh_hant: 尚未授予瀏覽器自動化權限。請允許 Glint 控制瀏覽器後再試。

source: Cancel
zh_hans: 取消
zh_hant: 取消

source: Checking API availability
zh_hans: 正在检查 API 可用性
zh_hant: 正在檢查 API 可用性

source: Checking backend availability
zh_hans: 正在检查后端可用性
zh_hant: 正在檢查後端可用性

source: Choose a shortcut to edit.
zh_hans: 选择一个要编辑的快捷键。
zh_hant: 選擇一個要編輯的快捷鍵。

source: Choose how Glint should translate text.
zh_hans: 选择 Glint 使用哪种方式翻译文本。
zh_hant: 選擇 Glint 使用哪種方式翻譯文字。

source: Click to change
zh_hans: 点击修改
zh_hant: 點擊修改

source: Clipboard
zh_hans: 剪贴板
zh_hant: 剪貼簿

source: Clipboard does not contain text.
zh_hans: 剪贴板中没有文本。
zh_hant: 剪貼簿中沒有文字。

source: Clipboard text exceeds the maximum length.
zh_hans: 剪贴板文本超出了最大长度。
zh_hant: 剪貼簿文字超出了最大長度。

source: Close
zh_hans: 关闭
zh_hant: 關閉

source: Configure the OpenAI-compatible endpoint Glint should use for translation.
zh_hans: 配置 Glint 用于翻译的 OpenAI-compatible endpoint。
zh_hant: 配置 Glint 用於翻譯的 OpenAI-compatible endpoint。

source: Could not load models from the API. You can still enter a model manually.
zh_hans: 无法从 API 拉取模型列表，你仍然可以手动输入模型名。
zh_hant: 無法從 API 載入模型列表，你仍然可以手動輸入模型名稱。

source: Custom API
zh_hans: 自定义 API
zh_hant: 自訂 API

source: Defaults could not be restored.
zh_hans: 无法恢复默认设置。
zh_hant: 無法恢復預設設定。

source: Defaults restored
zh_hans: 已恢复默认设置
zh_hant: 已恢復預設設定

source: Done
zh_hans: 完成
zh_hant: 完成

source: Drag to capture an area. Press Esc to cancel.
zh_hans: 拖动以框选区域，按 Esc 取消。
zh_hant: 拖曳以框選區域，按 Esc 取消。

source: Failed to restart the service
zh_hans: 重启服务失败
zh_hant: 重新啟動服務失敗

source: Failed to start the service
zh_hans: 启动服务失败
zh_hant: 啟動服務失敗

source: Failed to stop the service
zh_hans: 停止服务失败
zh_hant: 停止服務失敗

source: Frontmost app does not expose selected text through Accessibility APIs.
zh_hans: 当前前台应用未通过辅助功能 API 暴露选中文本。
zh_hant: 目前前景應用程式未透過輔助使用 API 提供選取文字。

source: Granted
zh_hans: 已授予
zh_hant: 已授予

source: Keyboard Shortcuts
zh_hans: 键盘快捷键
zh_hant: 鍵盤快捷鍵

source: Keyboard Shortcuts…
zh_hans: 键盘快捷键…
zh_hant: 鍵盤快捷鍵…

source: Local translation service is unavailable.
zh_hans: 本地翻译服务不可用。
zh_hant: 本地翻譯服務不可用。

source: Local translation service returned an invalid response.
zh_hans: 本地翻译服务返回了无效响应。
zh_hant: 本地翻譯服務回傳了無效回應。

source: Model
zh_hans: 模型
zh_hant: 模型

source: No selected text was found.
zh_hans: 未找到选中的文本。
zh_hant: 未找到選取的文字。

source: No text was provided.
zh_hans: 没有提供文本。
zh_hant: 沒有提供文字。

source: No text was recognized in the selected area.
zh_hans: 所选区域中没有识别到文本。
zh_hant: 所選區域中沒有辨識到文字。

source: OCR is unavailable on this system.
zh_hans: 此系统不支持 OCR。
zh_hant: 此系統不支援 OCR。

source: OCR Selection
zh_hans: OCR 区域选择
zh_hant: OCR 區域選取

source: Press a shortcut. Esc cancels.
zh_hans: 按下快捷键，按 Esc 取消。
zh_hant: 按下快捷鍵，按 Esc 取消。

source: Press keys
zh_hans: 按下按键
zh_hant: 按下按鍵

source: Preview:
zh_hans: 预览：
zh_hant: 預覽：

source: Quit %@
zh_hans: 退出 %@
zh_hant: 結束 %@

source: Recognized text exceeds the maximum length.
zh_hans: 识别出的文本超出了最大长度。
zh_hant: 辨識出的文字超出了最大長度。

source: Recording %@ Shortcut. Press the new key combination.
zh_hans: 正在录制 %@ 快捷键。请按下新的按键组合。
zh_hant: 正在錄製 %@ 快捷鍵。請按下新的按鍵組合。

source: Refresh Models
zh_hans: 刷新模型列表
zh_hant: 重新整理模型列表

source: Refresh Status
zh_hans: 刷新状态
zh_hant: 重新整理狀態

source: Required
zh_hans: 需要
zh_hant: 需要

source: Reset to Defaults
zh_hans: 恢复默认
zh_hant: 恢復預設

source: Save
zh_hans: 保存
zh_hant: 儲存

source: Selection
zh_hans: 划词
zh_hant: 劃詞

source: Service Status: Available
zh_hans: 服务状态：可用
zh_hant: 服務狀態：可用

source: Service Status: Checking...
zh_hans: 服务状态：检查中…
zh_hant: 服務狀態：檢查中…

source: Service Status: Error
zh_hans: 服务状态：错误
zh_hant: 服務狀態：錯誤

source: Service Status: Starting
zh_hans: 服务状态：启动中
zh_hant: 服務狀態：啟動中

source: Service Status: Unavailable
zh_hans: 服务状态：不可用
zh_hant: 服務狀態：不可用

source: Set shortcuts for selection, clipboard, and OCR translation.
zh_hans: 为划词、剪贴板和 OCR 翻译设置快捷键。
zh_hant: 為劃詞、剪貼簿與 OCR 翻譯設定快捷鍵。

source: Shortcut already in use. Try another combination.
zh_hans: 快捷键已被占用，请换一个组合键。
zh_hant: 快捷鍵已被佔用，請換一個組合鍵。

source: Shortcut could not be registered. Try another combination.
zh_hans: 快捷键无法注册，请换一个组合键。
zh_hant: 快捷鍵無法註冊，請換一個組合鍵。

source: Shortcut saved
zh_hans: 快捷键已保存
zh_hant: 快捷鍵已儲存

source: System Translation
zh_hans: 系统翻译
zh_hant: 系統翻譯

source: System Translation requires macOS 15 or later.
zh_hans: 系统翻译需要 macOS 15 或更高版本。
zh_hant: 系統翻譯需要 macOS 15 或更高版本。

source: Some system translation language data may need to download before first use.
zh_hans: 部分系统翻译语言数据可能需要在首次使用前下载。
zh_hant: 部分系統翻譯語言資料可能需要在首次使用前下載。

source: This Mac does not currently support English and Chinese system translation.
zh_hans: 这台 Mac 目前不支持英文和中文的系统翻译。
zh_hant: 這台 Mac 目前不支援英文和中文的系統翻譯。

source: English -> Simplified Chinese
zh_hans: 英文 -> 简体中文
zh_hant: 英文 -> 簡體中文

source: Chinese -> English
zh_hans: 中文 -> 英文
zh_hant: 中文 -> 英文

source: Installed
zh_hans: 已安装
zh_hant: 已安裝

source: Available After Download
zh_hans: 下载后可用
zh_hant: 下載後可用

source: Not Supported
zh_hans: 不支持
zh_hant: 不支援

source: Unavailable
zh_hans: 不可用
zh_hant: 不可用

source: Checking system translation availability...
zh_hans: 正在检查系统翻译可用性...
zh_hant: 正在檢查系統翻譯可用性...

source: English and Chinese system translation is ready on this Mac.
zh_hans: 这台 Mac 已具备英文和中文的系统翻译能力。
zh_hant: 這台 Mac 已具備英文和中文的系統翻譯能力。

source: System Translation could not complete the request.
zh_hans: 系统翻译未能完成这次请求。
zh_hant: 系統翻譯未能完成這次請求。

source: System Translation is unavailable on this Mac.
zh_hans: 这台 Mac 上无法使用系统翻译。
zh_hant: 這台 Mac 上無法使用系統翻譯。

source: Text exceeds the maximum length.
zh_hans: 文本超出了最大长度。
zh_hant: 文字超出了最大長度。

source: This clipboard text is longer than the quick-translate limit.
zh_hans: 这段剪贴板文本超过了快速翻译长度限制。
zh_hant: 這段剪貼簿文字超過了快速翻譯長度限制。

source: This shortcut is already used by Glint
zh_hans: 这个快捷键已被 Glint 使用
zh_hant: 這個快捷鍵已被 Glint 使用

source: Translate
zh_hans: 翻译
zh_hant: 翻譯

source: Translate Clipboard
zh_hans: 翻译剪贴板
zh_hant: 翻譯剪貼簿

source: Translate OCR Area
zh_hans: 翻译 OCR 区域
zh_hant: 翻譯 OCR 區域

source: Translate Selection
zh_hans: 翻译划词
zh_hant: 翻譯劃詞

source: Translating...
zh_hans: 翻译中…
zh_hant: 翻譯中…

source: Translation
zh_hans: 翻译结果
zh_hant: 翻譯結果

source: Translation API is currently unavailable
zh_hans: 翻译 API 当前不可用
zh_hant: 翻譯 API 目前不可用

source: Translation API is reachable
zh_hans: 翻译 API 可达
zh_hant: 翻譯 API 可達

source: Translation backend is reachable
zh_hans: 翻译后端可用
zh_hant: 翻譯後端可用

source: Translation failed
zh_hans: 翻译失败
zh_hant: 翻譯失敗

source: Translation Mode: System
zh_hans: 翻译模式：系统
zh_hant: 翻譯模式：系統

source: Translation request timed out.
zh_hans: 翻译请求超时。
zh_hant: 翻譯請求逾時。

source: Unable to capture the selected area.
zh_hans: 无法捕获所选区域。
zh_hant: 無法擷取所選區域。

source: Unable to verify API status
zh_hans: 无法验证 API 状态
zh_hant: 無法驗證 API 狀態

source: Unable to verify backend status
zh_hans: 无法验证后端状态
zh_hant: 無法驗證後端狀態

source: Use at least one modifier key.
zh_hans: 请至少使用一个修饰键。
zh_hant: 請至少使用一個修飾鍵。

source: Use the built-in macOS translation service. No API endpoint, API key, or model is required.
zh_hans: 使用 macOS 内建翻译服务。不需要 API 地址、API 密钥或模型。
zh_hant: 使用 macOS 內建翻譯服務。不需要 API 位址、API 金鑰或模型。

source: Use the global shortcut to translate the clipboard.
zh_hans: 使用全局快捷键来翻译剪贴板内容。
zh_hant: 使用全域快捷鍵來翻譯剪貼簿內容。

source: Using the built-in macOS translation service
zh_hans: 正在使用 macOS 内建翻译服务
zh_hant: 正在使用 macOS 內建翻譯服務
